Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::DuctTransitionPreferenceTable Class Referencefinal
MEP Element Manager
The DuctTransitionPreferenceTable contains cross section and geometry related information for Duct transitions. More...
#include <MEPDuctTransitionPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctTransitionPreferenceTable:
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetBeginReferenceId (uint32_t index) const
Result< uint32_t >  | GetEndReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Result< bool >  | IsRowValidByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Result< double >  | GetBeginDiameter (uint32_t index) const
Result< double >  | GetBeginDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< double >  | GetEndDiameter (uint32_t index) const
Result< double >  | GetEndDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< double >  | GetAngle (uint32_t index) const
Result< double >  | GetAngleByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewRow (uint32_t beginReferenceId, uint32_t endReferenceId)
Inserts a new row into the table.
Result< void >  | DeleteRow (uint32_t index)
Deletes a row from the table.
Result< void >  | DeleteRowByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId)
Deletes a row from the table.
Result< void >  | SetBeginDiameter (uint32_t index, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetBeginDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double diameter)
Sets the begin diameter value of a table's row.
Result< void >  | SetEndDiameter (uint32_t index, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetEndDiameterByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double diameter)
Sets the end diameter value of a table's row.
Result< void >  | SetAngle (uint32_t index, double angle)
Sets the angle value of a table's row.
Result< void >  | SetAngleByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, double angle)
Sets the angle value of a table's row.
Result< void >  | SetDescription (uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
Result< void >  | SetDescriptionByReferenceIds (uint32_t beginReferenceId, uint32_t endReferenceId, const GS::UniString &description)
Sets the description of a table's row.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< DuctTransitionPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a DuctTransitionPreferenceTable.
 Protected Member Functions
Modifier (DuctTransitionPreferenceTable &parent)
Constructs a Modifier with the given DuctTransitionPreferenceTable.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctTransitionPreferenceTable contains cross section and geometry related information for Duct transitions.
Since
Archicad 29
The table uses the keys defined by the DuctReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& ductTransitionTableId : ductTransitionTableIds) {
 ACAPI::Result<DuctTransitionPreferenceTable> ductTransitionTable = DuctTransitionPreferenceTable::Get (ductTransitionTableId);
 if (ductTransitionTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", ductTransitionTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < ductTransitionTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Begin ReferenceId", *ductTransitionTable->GetBeginReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End ReferenceId", *ductTransitionTable->GetEndReferenceId (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Begin Diameter", *ductTransitionTable->GetBeginDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("End Diameter", *ductTransitionTable->GetEndDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Angle", *ductTransitionTable->GetAngle (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductTransitionTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*ductTransitionTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification
 ACAPI::Result<DuctTransitionPreferenceTable> newTable = DuctTransitionPreferenceTable::Get (*newTableId);
 if (newTable.IsErr ())
 return newTable.UnwrapErr ().kind;
 ACAPI::Result<DuctReferenceSet> referenceSet = GetDuctReferenceSet ();
 if (referenceSet.IsErr ())
 return referenceSet.UnwrapErr ().kind;
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) -> GSErrCode {
 for (uint32_t i = 1; i < referenceSet->GetSize (); ++i) {
 ACAPI::Result<uint32_t> prevReferenceId = referenceSet->GetReferenceId (i - 1);
 ACAPI::Result<uint32_t> referenceId = referenceSet->GetReferenceId (i);
 ACAPI::Result<uint32_t> newRowIndex = modifier.AddNewRow (*referenceId, *prevReferenceId);
 if (newRowIndex.IsErr ())
 continue;
 modifier.SetBeginDiameter (*newRowIndex, static_cast<double> (*referenceId / 1000.0));
 modifier.SetEndDiameter (*newRowIndex, static_cast<double> (*prevReferenceId / 1000.0));
 modifier.SetAngle (*newRowIndex, 60.0);
 }
 return NoError;
 }, "Fill the new table with values");
 preferenceReporter.Add ("Delete the first row of the new Duct Transition table.");
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) {
 ACAPI::Result<void> deleteRowResult = modifier.DeleteRow (0);
 if (deleteRowResult.IsOk ())
 preferenceReporter.Add ("Delete row was successful.");
 else
 preferenceReporter.Add ("Delete row unsuccessful", GS::UniString (deleteRowResult.UnwrapErr ().text));
 }, "Delete Row from preference table.");
 preferenceReporter.Add ("Modify row identified by ReferenceIds.");
 newTable->Modify ([&] (DuctTransitionPreferenceTable::Modifier& modifier) {
 ACAPI::Result<uint32_t> beginReferenceId = newTable->GetBeginReferenceId (1);
 ACAPI::Result<uint32_t> endReferenceId = newTable->GetEndReferenceId (1);
 ACAPI::Result<double> currentAngle = newTable->GetAngleByReferenceIds (*beginReferenceId, *endReferenceId);
 modifier.SetAngleByReferenceIds (*beginReferenceId, *endReferenceId, *currentAngle / 2.0);
 modifier.SetDescriptionByReferenceIds (*beginReferenceId, *endReferenceId, "Halved!");
 }, "Modify row identified by ReferenceIds.");
 preferenceReporter.Write ();
Member Function Documentation
◆ AddNewRow()
 Result< uint32_t > ACAPI::MEP::v1::DuctTransitionPreferenceTable::AddNewRow  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
)
Inserts a new row into the table.
Parameters
beginReferenceId | The begin referenceId of the new row. It must be a referenceId that is defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the new row. It must be a referenceId that is defined in the DuctReferenceSet.
If endReferenceId is larger than the beginReferenceId, the two values will be swapped before insertion.
Returns
Returns error if the pair of referenceIds is already present in the table, otherwise the index of the new row.
◆ DeleteRow()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::DeleteRow  |  ( |  uint32_t  |  index | )
Deletes a row from the table.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ DeleteRowByReferenceIds()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::DeleteRowByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
)
Deletes a row from the table.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::DuctTransitionPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< DuctTransitionPreferenceTable > ACAPI::MEP::v1::DuctTransitionPreferenceTable::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a DuctTransitionPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested DuctTransitionPreferenceTable.
Returns
If the uniqueId belongs to a DuctTransitionPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetAngle()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetAngle  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the angle value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetAngleByReferenceIds()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetAngleByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the angle value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginDiameter()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetBeginDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginDiameterByReferenceIds()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetBeginDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the begin diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetBeginReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetBeginReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the begin referenceId of the table's row.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetDescription  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByReferenceIds()
 Result< GS::UniString > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetDescriptionByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the description of the table's row.
◆ GetEndDiameter()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetEndDiameter  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndDiameterByReferenceIds()
 Result< double > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetEndDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the end diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetEndReferenceId()
 Result< uint32_t > ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetEndReferenceId  |  ( |  uint32_t  |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the end referenceId of the table's row.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 uint32_t ACAPI::MEP::v1::DuctTransitionPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of table.
◆ IsEditable()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::v1::DuctTransitionPreferenceTable::IsRowValid  |  ( |  uint32_t  |  index | ) |   const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByReferenceIds()
 Result< bool > ACAPI::MEP::v1::DuctTransitionPreferenceTable::IsRowValidByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId
) |   |  const
A row is considered valid if both diameters and the transition angle contains non-zero values, description is optional.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Returns
Returns error if the pair of referenceIds does not occur in the table, otherwise returns the validity state of the row.
◆ Modifier()
 ACAPI::MEP::v1::DuctTransitionPreferenceTable::Modifier  |  ( |  DuctTransitionPreferenceTable &  |  parent | )
protected
Constructs a Modifier with the given DuctTransitionPreferenceTable.
Parameters
parent | The given DuctTransitionPreferenceTable.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetAngle()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetAngle  |  ( |  uint32_t  |  index,
|  double  |  angle
)
Sets the angle value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
angle | The value to be set. Needs to be between [1, 89] degrees.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
◆ SetAngleByReferenceIds()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetAngleByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  angle
)
Sets the angle value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
angle | The value to be set. Needs to be between [1, 89] degrees.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the DuctReferenceSet, it will insert the row.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
◆ SetBeginDiameter()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetBeginDiameter  |  ( |  uint32_t  |  index,
|  double  |  diameter
)
Sets the begin diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetBeginDiameterByReferenceIds()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetBeginDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  diameter
)
Sets the begin diameter value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
diameter | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if at least one referenceId is not in the DuctReferenceSet, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetDescription  |  ( |  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetDescriptionByReferenceIds()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetDescriptionByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
description | The description to be set.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if at least one referenceId is not in the DuctReferenceSet, otherwise nothing.
◆ SetEndDiameter()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetEndDiameter  |  ( |  uint32_t  |  index,
|  double  |  diameter
)
Sets the end diameter value of a table's row.
Parameters
index | The index of the row. Index starts from 0.
diameter | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the index is out of range, otherwise nothing.
◆ SetEndDiameterByReferenceIds()
 Result< void > ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetEndDiameterByReferenceIds  |  ( |  uint32_t  |  beginReferenceId,
|  uint32_t  |  endReferenceId,
|  double  |  diameter
)
Sets the end diameter value of a table's row.
Parameters
beginReferenceId | The begin referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
endReferenceId | The end referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
diameter | The value to be set. Must be a non-zero positive number.
If there isn't any row with the given pair of referenceIds, but both the referenceIds are defined in the DuctReferenceSet, it will insert the row.
Returns
Returns error if at least one referenceId is not in the DuctReferenceSet, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::v1::DuctTransitionPreferenceTable::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.